package com.e16din.fasttaxi

// DAY 3

/// Подготовка, планирование

// - Рефакторинг, убрать лишнее
// - Доработать авторизацию, сохранять данные профиля в файл, при входе смотреть на сохраненные действия
// - Добавить разлогин по ошибке 401 от сервера

/// Работа, реализация

// сделал только первый пункт, за 30 минут а не за 20

// почистил код (быстро)

// добавил проверки checkConditions(),
// увидел что это неудобно и громоздко, что затруднит разработку в будущем,
// экспериментировал, искал оптимальное решение (долго)

// доработал checkConditions() (быстро)

/// Передача, поставка

// ...



// DAY 2

/// Подготовка, планирование



// Работа, реализация

// Заняло больше запланированного времени

// Передача, поставка

// Не сделано:
// - Шторка выбора адреса
//    - 2 поля ввода адреса, старт и финиш
//    - список адресов
//    - переключаясь между полями выбора адреса - обновлять список

// Сделано:
// - Проверка условий, библиотека (проверено!)
